# CurveParamSteelCantilever Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveParamSteelCantilever Property
ParameterTypeId Class See Also
---
"Steel Cantilever"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveParamSteelCantilever { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveParamSteelCantilever As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveParamSteelCantilever {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace